In [19]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({'Employee':['Prabhavith'], 'Age':[34]})
df1

     Employee  Age
0  Prabhavith   34

In [36]:
df2 = pd.DataFrame({'Employee':['Vikash'], 'Age':[28]}, index=[1])
df2

  Employee  Age
1   Vikash   28

In [28]:
final_df = df1+df2
final_df

           Employee  Age
0  PrabhavithVikash   62

In [37]:
final_df = pd.concat([df1, df2])
final_df

     Employee  Age
0  Prabhavith   34
1      Vikash   28

In [10]:
final_df = pd.concat([df1, df2], axis=1)
final_df

     Employee  Age Employee  Age
0  Prabhavith   34   Vikash   28

In [11]:
final_df['Employee']

     Employee Employee
0  Prabhavith   Vikash

In [12]:
final_df.drop(columns=['Employee'], axis=1)

   Age  Age
0   34   28

In [15]:
final_df

     Employee  Age Employee  Age
0  Prabhavith   34   Vikash   28

In [16]:
final_df.drop(index=[0], axis=0)

Empty DataFrame
Columns: [Employee, Age, Employee, Age]
Index: []

In [20]:
data = np.random.rand(2,4,5)
p = pd.Panel(data)
p

c:\python36_64\lib\site-packages\IPython\core\interactiveshell.py:2961: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 4 (major_axis) x 5 (minor_axis)
Items axis: 0 to 1
Major_axis axis: 0 to 3
Minor_axis axis: 0 to 4

In [21]:
data

array([[[0.28106164, 0.10531691, 0.8955526 , 0.97225906, 0.23486332],
        [0.80628659, 0.15360892, 0.83842101, 0.24137237, 0.18140084],
        [0.62150725, 0.7631784 , 0.91011843, 0.5785596 , 0.72621683],
        [0.53982065, 0.84241684, 0.9613681 , 0.12354491, 0.20789821]],

       [[0.03429756, 0.87933123, 0.20431566, 0.27301417, 0.55819245],
        [0.75593253, 0.28769528, 0.67924403, 0.27311479, 0.00817118],
        [0.98606842, 0.78545363, 0.33134503, 0.10669609, 0.25290026],
        [0.21403935, 0.34522878, 0.99972244, 0.11158639, 0.25523648]]])

In [30]:
final_df.drop(final_df.index, axis=0)

Empty DataFrame
Columns: [Employee, Age]
Index: []

In [32]:
final_df

     Employee  Age
0  Prabhavith   34
0      Vikash   28

In [38]:
final_df.index

Int64Index([0, 1], dtype='int64')